app/controllers/posts_controller.rb

  def create
    Post.create(title: params[:title], content: params[:content])
---
INSERT INTO "posts" ("title", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "title1"], ["content", "content1"], ["created_at", "2022-12-11 04:06:03.704257"], ["updated_at", "2022-12-11 04:06:03.704257"]]

  def update
    # 기존 글 검색
    @post = Post.find(params[:id])
    # 기존 글 수정
    @post.update(title: params[:title], content: params[:content])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "posts" SET "content" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["content", "content1\nupdate\n  "], ["updated_at", "2022-12-11 12:15:28.855149"], ["id", 1]]